
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10653125521)



<pre><code>Apply complete! Resources: 1 added, 3 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-master/runs/run-Jv1EFDepvxp13e4c

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=a302387976ce74579a87a903dcc6149f70895053]
data.aws_caller_identity.current: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=trigger_user_scan]
aws_dynamodb_table.Users: Refreshing state... [id=Users]
data.aws_iam_role.role: Reading...
aws_lambda_layer_version.test_lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6]
aws_api_gateway_rest_api.api: Refreshing state... [id=gozv19c3jf]
aws_dynamodb_table.Link_table: Refreshing state... [id=Link_table]
aws_dynamodb_table.Register: Refreshing state... [id=Register]
aws_s3_bucket.images: Refreshing state... [id=djansang]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=gtenoa]
aws_api_gateway_method.method: Refreshing state... [id=agm-gozv19c3jf-gtenoa-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-gozv19c3jf-gtenoa-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=trigger_user_scan-lambda]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-gozv19c3jf-gtenoa-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-gozv19c3jf-gtenoa-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-gozv19c3jf-gtenoa-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-gozv19c3jf-gtenoa-POST]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-gozv19c3jf-gtenoa-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=7suq19]
local_file.index_page: Refreshing state... [id=c845316bee69b44546aed5f465d68859a00ebc56]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
      ~ billing_mode   = "PROVISIONED" -> "PAY_PER_REQUEST"
        id             = "Link_table"
        name           = "Link_table"
      ~ read_capacity  = 1 -> 3
        tags           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.872/mo +$0.1872

------------------------------------------------------------------------

aws_dynamodb_table.Link_table: Modifying... [id=Link_table]
aws_s3_bucket.images: Modifying... [id=djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=c845316bee69b44546aed5f465d68859a00ebc56]
aws_s3_bucket.website: Modifications complete after 5s [id=mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Modifications complete after 5s [id=djansang]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 1m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 1m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 1m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 1m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 1m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 1m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 2m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 2m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 2m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 2m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 2m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 2m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 3m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 3m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 3m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 3m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 3m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 3m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 4m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 4m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 4m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 4m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 4m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 4m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 5m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 5m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 5m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 5m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 5m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 5m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 6m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 6m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 6m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 6m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 6m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 6m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 7m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 7m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 7m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 7m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 7m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 7m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 8m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 8m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 8m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 8m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 8m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 8m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 9m0s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 9m10s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 9m20s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 9m30s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 9m40s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 9m50s elapsed]
aws_dynamodb_table.Link_table: Still modifying... [id=Link_table, 10m0s elapsed]
aws_dynamodb_table.Link_table: Modifications complete after 10m3s [id=Link_table]

Apply complete! Resources: 1 added, 3 changed, 0 destroyed.

Outputs:

register_table = "Register"
stage_url = "https://gozv19c3jf.execute-api.eu-central-1.amazonaws.com/dev"
website_url = "http://mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":189,"Program":"tfcmt","SHA1":"de027ea99062da07102529d10515c8e1502825af","Vars":{},"WorkflowName":"Deploy cases"} -->